; domain
;; The "Springer Game" is a chess puzzle (an implementation of the game
;; came along with the -99 Springer Verlag CD-ROM catalogue).
;; The objective is to step exactly once on each square of a chess board,
;; using the moves of a knight (?) ("springer", in german, I guess). The
;; choice of initial position is free (though it might as well be fixed,
;; since there's (supposedly, I haven't checked) exactly one solution for
;; each initial position).

;; The predicate "at" encodes the piece's current position, while "clear"
;; and "mark" keep track of visited squares. The "inc" and "dec" predicates
;; encode addition and subtraction.

;; There are four problem instance files:
;;  - springer1.pddl is the vanilla version.
;;  - springer1x.pddl uses separate objects for x and y coordinates, since
;;    some planners seem to require different objects for each parameter of
;;    an operator (which seems like a silly thing).
;;  - springer2.pddl has a fixed initial position (upper left corner).
;;  - springer2x.pddl is the same but using x/y objects.

;; This seems to be a very hard problem; I've not found any planner that
;; can solve it yet.

(define (domain springer_game)
  (:requirements :strips)
  (:predicates (ready) (at ?x ?y) (clear ?x ?y) (mark ?x ?y)
	       (inc ?p ?pp) (dec ?p ?pp))

  (:action start
    :parameters (?px ?py)
    :precondition (ready)
    :effect (and (not (ready)) (at ?px ?py) (not (clear ?px ?py))
		 (mark ?px ?py)))

  (:action RRD ; right-right-down
    :parameters (?px ?py ?fx ?fy ?ix)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (inc ?px ?ix) (inc ?ix ?fx) (inc ?py ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))

  (:action RRU ; right-right-up
    :parameters (?px ?py ?fx ?fy ?ix)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (inc ?px ?ix) (inc ?ix ?fx) (dec ?py ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))

  (:action LLD ; left-left-down
    :parameters (?px ?py ?fx ?fy ?ix)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (dec ?px ?ix) (dec ?ix ?fx) (inc ?py ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))

  (:action LLU ; left-left-up
    :parameters (?px ?py ?fx ?fy ?ix)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (dec ?px ?ix) (dec ?ix ?fx) (dec ?py ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))

  (:action RDD ; right-down-down
    :parameters (?px ?py ?fx ?fy ?iy)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (inc ?px ?fx) (inc ?py ?iy) (inc ?iy ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))

  (:action RUU ; right-up-up
    :parameters (?px ?py ?fx ?fy ?iy)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (inc ?px ?fx) (dec ?py ?iy) (dec ?iy ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))

  (:action LDD ; left-down-down
    :parameters (?px ?py ?fx ?fy ?iy)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (dec ?px ?fx) (inc ?py ?iy) (inc ?iy ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))

  (:action LUU ; left-up-up
    :parameters (?px ?py ?fx ?fy ?iy)
    :precondition (and (at ?px ?py) (clear ?fx ?fy)
		       (dec ?px ?fx) (dec ?py ?iy) (dec ?iy ?fy))
    :effect (and (not (at ?px ?py)) (not (clear ?fx ?fy))
		 (at ?fx ?fy) (mark ?fx ?fy)))
  )

; problem
(define (problem springer_game2)
  (:domain springer_game)
  (:objects x1 x2 x3 x4 x5 x6 x7 x8 y1 y2 y3 y4 y5 y6 y7 y8)
  (:init (inc x1 x2) (inc x2 x3) (inc x3 x4) (inc x4 x5) (inc x5 x6)
	 (inc x6 x7) (inc x7 x8) (dec x8 x7) (dec x7 x6) (dec x6 x5)
	 (dec x5 x4) (dec x4 x3) (dec x3 x2) (dec x2 x1)
	 (inc y1 y2) (inc y2 y3) (inc y3 y4) (inc y4 y5) (inc y5 y6)
	 (inc y6 y7) (inc y7 y8) (dec y8 y7) (dec y7 y6) (dec y6 y5)
	 (dec y5 y4) (dec y4 y3) (dec y3 y2) (dec y2 y1)
	 (mark x1 y1) (clear x1 y2) (clear x1 y3) (clear x1 y4)
	 (clear x1 y5) (clear x1 y6) (clear x1 y7) (clear x1 y8)
	 (clear x2 y1) (clear x2 y2) (clear x2 y3) (clear x2 y4)
	 (clear x2 y5) (clear x2 y6) (clear x2 y7) (clear x2 y8)
	 (clear x3 y1) (clear x3 y2) (clear x3 y3) (clear x3 y4)
	 (clear x3 y5) (clear x3 y6) (clear x3 y7) (clear x3 y8)
	 (clear x4 y1) (clear x4 y2) (clear x4 y3) (clear x4 y4)
	 (clear x4 y5) (clear x4 y6) (clear x4 y7) (clear x4 y8)
	 (clear x5 y1) (clear x5 y2) (clear x5 y3) (clear x5 y4)
	 (clear x5 y5) (clear x5 y6) (clear x5 y7) (clear x5 y8)
	 (clear x6 y1) (clear x6 y2) (clear x6 y3) (clear x6 y4)
	 (clear x6 y5) (clear x6 y6) (clear x6 y7) (clear x6 y8)
	 (clear x7 y1) (clear x7 y2) (clear x7 y3) (clear x7 y4)
	 (clear x7 y5) (clear x7 y6) (clear x7 y7) (clear x7 y8)
	 (clear x8 y1) (clear x8 y2) (clear x8 y3) (clear x8 y4)
	 (clear x8 y5) (clear x8 y6) (clear x8 y7) (clear x8 y8)
	 (at x1 y1))
  (:goal (and (mark x1 y1) (mark x1 y2) (mark x1 y3) (mark x1 y4)
	      (mark x1 y5) (mark x1 y6) (mark x1 y7) (mark x1 y8)
	      (mark x2 y1) (mark x2 y2) (mark x2 y3) (mark x2 y4)
	      (mark x2 y5) (mark x2 y6) (mark x2 y7) (mark x2 y8)
	      (mark x3 y1) (mark x3 y2) (mark x3 y3) (mark x3 y4)
	      (mark x3 y5) (mark x3 y6) (mark x3 y7) (mark x3 y8)
	      (mark x4 y1) (mark x4 y2) (mark x4 y3) (mark x4 y4)
	      (mark x4 y5) (mark x4 y6) (mark x4 y7) (mark x4 y8)
	      (mark x5 y1) (mark x5 y2) (mark x5 y3) (mark x5 y4)
	      (mark x5 y5) (mark x5 y6) (mark x5 y7) (mark x5 y8)
	      (mark x6 y1) (mark x6 y2) (mark x6 y3) (mark x6 y4)
	      (mark x6 y5) (mark x6 y6) (mark x6 y7) (mark x6 y8)
	      (mark x7 y1) (mark x7 y2) (mark x7 y3) (mark x7 y4)
	      (mark x7 y5) (mark x7 y6) (mark x7 y7) (mark x7 y8)
	      (mark x8 y1) (mark x8 y2) (mark x8 y3) (mark x8 y4)
	      (mark x8 y5) (mark x8 y6) (mark x8 y7) (mark x8 y8)))
)

; plan
1. (rdd x1 y1 x2 y3 y2)
   deleted: (at x1 y1) (clear x2 y3)
   added: (at x2 y3) (mark x2 y3)
   goals met: 2 of 64
2. (ruu x2 y3 x3 y1 y2)
   deleted: (at x2 y3) (clear x3 y1)
   added: (at x3 y1) (mark x3 y1)
   goals met: 3 of 64
3. (lld x3 y1 x1 y2 x2)
   deleted: (at x3 y1) (clear x1 y2)
   added: (at x1 y2) (mark x1 y2)
   goals met: 4 of 64
4. (rdd x1 y2 x2 y4 y3)
   deleted: (at x1 y2) (clear x2 y4)
   added: (at x2 y4) (mark x2 y4)
   goals met: 5 of 64
5. (ldd x2 y4 x1 y6 y5)
   deleted: (at x2 y4) (clear x1 y6)
   added: (at x1 y6) (mark x1 y6)
   goals met: 6 of 64
6. (rdd x1 y6 x2 y8 y7)
   deleted: (at x1 y6) (clear x2 y8)
   added: (at x2 y8) (mark x2 y8)
   goals met: 7 of 64
7. (rru x2 y8 x4 y7 x3)
   deleted: (at x2 y8) (clear x4 y7)
   added: (at x4 y7) (mark x4 y7)
   goals met: 8 of 64
8. (rrd x4 y7 x6 y8 x5)
   deleted: (at x4 y7) (clear x6 y8)
   added: (at x6 y8) (mark x6 y8)
   goals met: 9 of 64
9. (rru x6 y8 x8 y7 x7)
   deleted: (at x6 y8) (clear x8 y7)
   added: (at x8 y7) (mark x8 y7)
   goals met: 10 of 64
10. (luu x8 y7 x7 y5 y6)
   deleted: (at x8 y7) (clear x7 y5)
   added: (at x7 y5) (mark x7 y5)
   goals met: 11 of 64
11. (ruu x7 y5 x8 y3 y4)
   deleted: (at x7 y5) (clear x8 y3)
   added: (at x8 y3) (mark x8 y3)
   goals met: 12 of 64
12. (luu x8 y3 x7 y1 y2)
   deleted: (at x8 y3) (clear x7 y1)
   added: (at x7 y1) (mark x7 y1)
   goals met: 13 of 64
13. (lld x7 y1 x5 y2 x6)
   deleted: (at x7 y1) (clear x5 y2)
   added: (at x5 y2) (mark x5 y2)
   goals met: 14 of 64
14. (rrd x5 y2 x7 y3 x6)
   deleted: (at x5 y2) (clear x7 y3)
   added: (at x7 y3) (mark x7 y3)
   goals met: 15 of 64
15. (ruu x7 y3 x8 y1 y2)
   deleted: (at x7 y3) (clear x8 y1)
   added: (at x8 y1) (mark x8 y1)
   goals met: 16 of 64
16. (lld x8 y1 x6 y2 x7)
   deleted: (at x8 y1) (clear x6 y2)
   added: (at x6 y2) (mark x6 y2)
   goals met: 17 of 64
17. (llu x6 y2 x4 y1 x5)
   deleted: (at x6 y2) (clear x4 y1)
   added: (at x4 y1) (mark x4 y1)
   goals met: 18 of 64
18. (lld x4 y1 x2 y2 x3)
   deleted: (at x4 y1) (clear x2 y2)
   added: (at x2 y2) (mark x2 y2)
   goals met: 19 of 64
19. (ldd x2 y2 x1 y4 y3)
   deleted: (at x2 y2) (clear x1 y4)
   added: (at x1 y4) (mark x1 y4)
   goals met: 20 of 64
20. (rdd x1 y4 x2 y6 y5)
   deleted: (at x1 y4) (clear x2 y6)
   added: (at x2 y6) (mark x2 y6)
   goals met: 21 of 64
21. (ldd x2 y6 x1 y8 y7)
   deleted: (at x2 y6) (clear x1 y8)
   added: (at x1 y8) (mark x1 y8)
   goals met: 22 of 64
22. (rru x1 y8 x3 y7 x2)
   deleted: (at x1 y8) (clear x3 y7)
   added: (at x3 y7) (mark x3 y7)
   goals met: 23 of 64
23. (rrd x3 y7 x5 y8 x4)
   deleted: (at x3 y7) (clear x5 y8)
   added: (at x5 y8) (mark x5 y8)
   goals met: 24 of 64
24. (rru x5 y8 x7 y7 x6)
   deleted: (at x5 y8) (clear x7 y7)
   added: (at x7 y7) (mark x7 y7)
   goals met: 25 of 64
25. (ruu x7 y7 x8 y5 y6)
   deleted: (at x7 y7) (clear x8 y5)
   added: (at x8 y5) (mark x8 y5)
   goals met: 26 of 64
26. (lld x8 y5 x6 y6 x7)
   deleted: (at x8 y5) (clear x6 y6)
   added: (at x6 y6) (mark x6 y6)
   goals met: 27 of 64
27. (rdd x6 y6 x7 y8 y7)
   deleted: (at x6 y6) (clear x7 y8)
   added: (at x7 y8) (mark x7 y8)
   goals met: 28 of 64
28. (ruu x7 y8 x8 y6 y7)
   deleted: (at x7 y8) (clear x8 y6)
   added: (at x8 y6) (mark x8 y6)
   goals met: 29 of 64
29. (lld x8 y6 x6 y7 x7)
   deleted: (at x8 y6) (clear x6 y7)
   added: (at x6 y7) (mark x6 y7)
   goals met: 30 of 64
30. (rrd x6 y7 x8 y8 x7)
   deleted: (at x6 y7) (clear x8 y8)
   added: (at x8 y8) (mark x8 y8)
   goals met: 31 of 64
31. (luu x8 y8 x7 y6 y7)
   deleted: (at x8 y8) (clear x7 y6)
   added: (at x7 y6) (mark x7 y6)
   goals met: 32 of 64
32. (ruu x7 y6 x8 y4 y5)
   deleted: (at x7 y6) (clear x8 y4)
   added: (at x8 y4) (mark x8 y4)
   goals met: 33 of 64
33. (luu x8 y4 x7 y2 y3)
   deleted: (at x8 y4) (clear x7 y2)
   added: (at x7 y2) (mark x7 y2)
   goals met: 34 of 64
34. (llu x7 y2 x5 y1 x6)
   deleted: (at x7 y2) (clear x5 y1)
   added: (at x5 y1) (mark x5 y1)
   goals met: 35 of 64
35. (lld x5 y1 x3 y2 x4)
   deleted: (at x5 y1) (clear x3 y2)
   added: (at x3 y2) (mark x3 y2)
   goals met: 36 of 64
36. (lld x3 y2 x1 y3 x2)
   deleted: (at x3 y2) (clear x1 y3)
   added: (at x1 y3) (mark x1 y3)
   goals met: 37 of 64
37. (ruu x1 y3 x2 y1 y2)
   deleted: (at x1 y3) (clear x2 y1)
   added: (at x2 y1) (mark x2 y1)
   goals met: 38 of 64
38. (rrd x2 y1 x4 y2 x3)
   deleted: (at x2 y1) (clear x4 y2)
   added: (at x4 y2) (mark x4 y2)
   goals met: 39 of 64
39. (rru x4 y2 x6 y1 x5)
   deleted: (at x4 y2) (clear x6 y1)
   added: (at x6 y1) (mark x6 y1)
   goals met: 40 of 64
40. (rrd x6 y1 x8 y2 x7)
   deleted: (at x6 y1) (clear x8 y2)
   added: (at x8 y2) (mark x8 y2)
   goals met: 41 of 64
41. (ldd x8 y2 x7 y4 y3)
   deleted: (at x8 y2) (clear x7 y4)
   added: (at x7 y4) (mark x7 y4)
   goals met: 42 of 64
42. (llu x7 y4 x5 y3 x6)
   deleted: (at x7 y4) (clear x5 y3)
   added: (at x5 y3) (mark x5 y3)
   goals met: 43 of 64
43. (rdd x5 y3 x6 y5 y4)
   deleted: (at x5 y3) (clear x6 y5)
   added: (at x6 y5) (mark x6 y5)
   goals met: 44 of 64
44. (ldd x6 y5 x5 y7 y6)
   deleted: (at x6 y5) (clear x5 y7)
   added: (at x5 y7) (mark x5 y7)
   goals met: 45 of 64
45. (lld x5 y7 x3 y8 x4)
   deleted: (at x5 y7) (clear x3 y8)
   added: (at x3 y8) (mark x3 y8)
   goals met: 46 of 64
46. (llu x3 y8 x1 y7 x2)
   deleted: (at x3 y8) (clear x1 y7)
   added: (at x1 y7) (mark x1 y7)
   goals met: 47 of 64
47. (ruu x1 y7 x2 y5 y6)
   deleted: (at x1 y7) (clear x2 y5)
   added: (at x2 y5) (mark x2 y5)
   goals met: 48 of 64
48. (rrd x2 y5 x4 y6 x3)
   deleted: (at x2 y5) (clear x4 y6)
   added: (at x4 y6) (mark x4 y6)
   goals met: 49 of 64
49. (lld x4 y6 x2 y7 x3)
   deleted: (at x4 y6) (clear x2 y7)
   added: (at x2 y7) (mark x2 y7)
   goals met: 50 of 64
50. (rrd x2 y7 x4 y8 x3)
   deleted: (at x2 y7) (clear x4 y8)
   added: (at x4 y8) (mark x4 y8)
   goals met: 51 of 64
51. (ruu x4 y8 x5 y6 y7)
   deleted: (at x4 y8) (clear x5 y6)
   added: (at x5 y6) (mark x5 y6)
   goals met: 52 of 64
52. (ruu x5 y6 x6 y4 y5)
   deleted: (at x5 y6) (clear x6 y4)
   added: (at x6 y4) (mark x6 y4)
   goals met: 53 of 64
53. (lld x6 y4 x4 y5 x5)
   deleted: (at x6 y4) (clear x4 y5)
   added: (at x4 y5) (mark x4 y5)
   goals met: 54 of 64
54. (luu x4 y5 x3 y3 y4)
   deleted: (at x4 y5) (clear x3 y3)
   added: (at x3 y3) (mark x3 y3)
   goals met: 55 of 64
55. (rrd x3 y3 x5 y4 x4)
   deleted: (at x3 y3) (clear x5 y4)
   added: (at x5 y4) (mark x5 y4)
   goals met: 56 of 64
56. (lld x5 y4 x3 y5 x4)
   deleted: (at x5 y4) (clear x3 y5)
   added: (at x3 y5) (mark x3 y5)
   goals met: 57 of 64
57. (ruu x3 y5 x4 y3 y4)
   deleted: (at x3 y5) (clear x4 y3)
   added: (at x4 y3) (mark x4 y3)
   goals met: 58 of 64
58. (rdd x4 y3 x5 y5 y4)
   deleted: (at x4 y3) (clear x5 y5)
   added: (at x5 y5) (mark x5 y5)
   goals met: 59 of 64
59. (ruu x5 y5 x6 y3 y4)
   deleted: (at x5 y5) (clear x6 y3)
   added: (at x6 y3) (mark x6 y3)
   goals met: 60 of 64
60. (lld x6 y3 x4 y4 x5)
   deleted: (at x6 y3) (clear x4 y4)
   added: (at x4 y4) (mark x4 y4)
   goals met: 61 of 64
61. (ldd x4 y4 x3 y6 y5)
   deleted: (at x4 y4) (clear x3 y6)
   added: (at x3 y6) (mark x3 y6)
   goals met: 62 of 64
62. (llu x3 y6 x1 y5 x2)
   deleted: (at x3 y6) (clear x1 y5)
   added: (at x1 y5) (mark x1 y5)
   goals met: 63 of 64
63. (rru x1 y5 x3 y4 x2)
   deleted: (at x1 y5) (clear x3 y4)
   added: (at x3 y4) (mark x3 y4)
   goals met: 64 of 64
